# 算术运算符

print(3+5<<1)
print(3+(5<<1))

print([1,2,3]+[4,5,6])

# 当元组只包含一个元素的时候需要加,来表示这是个元组
print((1,2,3)+(4,5))

print([1,2,3]*3)
print((1,2,3)*3)
print('abc'*3)

# 关于python运算符/和//
# /表示数学意义上的除法
print(3/2) 
print(4/2)

# 如果两个操作数都是整数，//结果是整数
print(15//4)
# 如果操作数种有实数，结果为实数形式的整数值
print(15.0/4)
# //是向下取整
print(-15//4)

# 关于%运算符的使用
# 求余数
print(789%23) 
print(123.4%3.2)
# 用于格式化
print('%c, %d' % (65,65))
print('%f, %s' % (65,65))

# 幂运算**
# 从右往左算
print(3**2**3)

# 关于关系运算符
# 关系运算符可以连用，要求操作数之间必须可以比较大小
print(1<3<5)
print(3<5>2)
print('Hello'>'world')
print([1,2,3]<[1,2,4])
# 判断是否为子集
print({1,2,3}<{1,2,3,4})

# 成员测试运算符
print(3 in [1,2,3])
print(5 in range(1,10,1))
print('abc' in 'ancdef')

for i in (3,5,7):
    print(i,end='\t')

# 聚合运算符
# 并集
print({1,2,3,8}|{1,2,3,4,5})
# 交集
print({1,2,3}&{2,3,4})
# 对称差集
print({1,2,3}^{2,3,4})
# 差集
print({1,2,3}-{2,3,4})

# 逻辑运算符 and or not

# 查看内置函数和对象
